#1. Создать список и заполнить его элементами
#различных типов данных. Реализовать скрипт
#проверки типа данных каждого элемента.
#Использовать функцию type() для проверки типа.
#Элементы списка можно не запрашивать у
#пользователя, а указать явно, в программе.
my_list = [3, 'text', 50.4, None]
for item in my_list:
    print(item, type(item))






